In [1]:
import pandas as pd
import numpy as np
pd.__version__

'1.0.3'

## Series

In [2]:
a = pd.Series([1,2,3,4,5])
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
a = pd.Series([1,2,3,4,5],dtype=np.float)   #Se utiliza numpy para cambiar el tipo de dato
a

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [4]:
a[0]
a[0] = 90.0 
a

0    90.0
1     2.0
2     3.0
3     4.0
4     5.0
dtype: float64

In [5]:
a[(a>4) | (a==2)]   #or es | en pandas y and es &

0    90.0
1     2.0
4     5.0
dtype: float64

In [6]:
a = pd.Series([1,np.NaN,3,np.NaN,5])
a

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
dtype: float64

In [7]:
pd.isnull(a)   #notnull

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [8]:
a.dropna()   #Quitar valores nulos

0    1.0
2    3.0
4    5.0
dtype: float64

In [9]:
a = pd.Series([1,np.NaN,3,np.NaN,5])
a

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
dtype: float64

In [10]:
a.fillna(99)

0     1.0
1    99.0
2     3.0
3    99.0
4     5.0
dtype: float64

## Dataframe

In [11]:
dict_data = {'CO':100,'MX':200,'AR':300}
dict_data.keys()

dict_keys(['CO', 'MX', 'AR'])

In [12]:
dicc = {
    'nombre': ['ana','benito','camilo','daniel','erika','fabian','gabriela'],
    'edad': [10, 9, 13, 14, 12, 11, 12],
    'cm': [115, 110, 130, 155, 125, 120, 125],
    'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'Q1': [5, 10, 8, np.nan, 7, 8, 3],
    'Q2': [7, 9, 9, 8, 8, 8, 9.]}
pd.DataFrame(dicc)#, index=['a','b','c','d','e','f','g'])

     nombre  edad   cm pais genero    Q1   Q2
0       ana    10  115   co      M   5.0  7.0
1    benito     9  110   mx      F  10.0  9.0
2    camilo    13  130   co      F   8.0  9.0
3    daniel    14  155   mx      M   NaN  8.0
4     erika    12  125   mx      M   7.0  8.0
5    fabian    11  120   ch      M   8.0  8.0
6  gabriela    12  125   ch      F   3.0  9.0

In [13]:
a = pd.DataFrame(dicc)
a['nombre'].head(2)

0       ana
1    benito
Name: nombre, dtype: object

In [14]:
a.index #.values

RangeIndex(start=0, stop=7, step=1)

In [15]:
a.columns #.values

Index(['nombre', 'edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

In [16]:
a['Q1'].values

array([ 5., 10.,  8., nan,  7.,  8.,  3.])

In [17]:
a.pais.unique()      #Trae los valores unicos de la columna

array(['co', 'mx', 'ch'], dtype=object)

In [18]:
a.genero.value_counts()

M    4
F    3
Name: genero, dtype: int64

In [19]:
a.values

array([['ana', 10, 115, 'co', 'M', 5.0, 7.0],
       ['benito', 9, 110, 'mx', 'F', 10.0, 9.0],
       ['camilo', 13, 130, 'co', 'F', 8.0, 9.0],
       ['daniel', 14, 155, 'mx', 'M', nan, 8.0],
       ['erika', 12, 125, 'mx', 'M', 7.0, 8.0],
       ['fabian', 11, 120, 'ch', 'M', 8.0, 8.0],
       ['gabriela', 12, 125, 'ch', 'F', 3.0, 9.0]], dtype=object)

In [20]:
a[['nombre','edad']]

     nombre  edad
0       ana    10
1    benito     9
2    camilo    13
3    daniel    14
4     erika    12
5    fabian    11
6  gabriela    12

In [21]:
b = pd.DataFrame(dicc,columns= ['nombre','edad'])
b.head()

   nombre  edad
0     ana    10
1  benito     9
2  camilo    13
3  daniel    14
4   erika    12

In [22]:
a.rename(columns = {'edad':'age'})

     nombre  age   cm pais genero    Q1   Q2
0       ana   10  115   co      M   5.0  7.0
1    benito    9  110   mx      F  10.0  9.0
2    camilo   13  130   co      F   8.0  9.0
3    daniel   14  155   mx      M   NaN  8.0
4     erika   12  125   mx      M   7.0  8.0
5    fabian   11  120   ch      M   8.0  8.0
6  gabriela   12  125   ch      F   3.0  9.0

In [23]:
a.edad[a.edad>10]       #Se aplica el filtro en la columna

2    13
3    14
4    12
5    11
6    12
Name: edad, dtype: int64

In [24]:
a['edad'] >= 12

0    False
1    False
2     True
3     True
4     True
5    False
6     True
Name: edad, dtype: bool

In [25]:
a[a['edad'] >= 12]          #Se aplica la logica al dataframe

     nombre  edad   cm pais genero   Q1   Q2
2    camilo    13  130   co      F  8.0  9.0
3    daniel    14  155   mx      M  NaN  8.0
4     erika    12  125   mx      M  7.0  8.0
6  gabriela    12  125   ch      F  3.0  9.0

In [26]:
mask = (a['edad'] >= 12) & (a['pais'].isin(['mx','ch']))    #Booleann filtering
mask

0    False
1    False
2    False
3     True
4     True
5    False
6     True
dtype: bool

In [27]:
a[mask]

     nombre  edad   cm pais genero   Q1   Q2
3    daniel    14  155   mx      M  NaN  8.0
4     erika    12  125   mx      M  7.0  8.0
6  gabriela    12  125   ch      F  3.0  9.0

In [28]:
a.query('edad >= 12 & pais == ["mx","ch"]')       #Filtros, forma de sustituir a los boolean filtering

     nombre  edad   cm pais genero   Q1   Q2
3    daniel    14  155   mx      M  NaN  8.0
4     erika    12  125   mx      M  7.0  8.0
6  gabriela    12  125   ch      F  3.0  9.0

In [29]:
a[a['Q2'] >= a['Q1']]

     nombre  edad   cm pais genero   Q1   Q2
0       ana    10  115   co      M  5.0  7.0
2    camilo    13  130   co      F  8.0  9.0
4     erika    12  125   mx      M  7.0  8.0
5    fabian    11  120   ch      M  8.0  8.0
6  gabriela    12  125   ch      F  3.0  9.0

In [30]:
a['edad']= a.apply(lambda row: row['edad'] +1, axis=1)
a

     nombre  edad   cm pais genero    Q1   Q2
0       ana    11  115   co      M   5.0  7.0
1    benito    10  110   mx      F  10.0  9.0
2    camilo    14  130   co      F   8.0  9.0
3    daniel    15  155   mx      M   NaN  8.0
4     erika    13  125   mx      M   7.0  8.0
5    fabian    12  120   ch      M   8.0  8.0
6  gabriela    13  125   ch      F   3.0  9.0

In [31]:
df=pd.read_csv('C:\\bicicletas-compartidas.csv',usecols=['fecha','bicis-compartidas','hum','viento'])   #na_values=['valor'])
df.head()

                 fecha  bicis-compartidas    hum  viento
0  2015-01-04 00:00:00                182   93.0     6.0
1  2015-01-04 01:00:00                138   93.0     5.0
2  2015-01-04 02:00:00                134   96.5     0.0
3  2015-01-04 03:00:00                 72  100.0     0.0
4  2015-01-04 04:00:00                 47   93.0     6.5

In [32]:
df.viento.notnull()
#ejemplo paises.apply(lambda row: int(str(row['poblacion']).replace('.','')),axis=1)

0        True
1        True
2        True
3        True
4        True
         ...
17409    True
17410    True
17411    True
17412    True
17413    True
Name: viento, Length: 17414, dtype: bool

In [33]:
df.sort_index(ascending=False)

                     fecha  bicis-compartidas    hum  viento
17413  2017-01-03 23:00:00                139   76.0    22.0
17412  2017-01-03 22:00:00                224   76.0    23.0
17411  2017-01-03 21:00:00                337   78.5    24.0
17410  2017-01-03 20:00:00                541   81.0    21.0
17409  2017-01-03 19:00:00               1042   81.0    19.0
...                    ...                ...    ...     ...
4      2015-01-04 04:00:00                 47   93.0     6.5
3      2015-01-04 03:00:00                 72  100.0     0.0
2      2015-01-04 02:00:00                134   96.5     0.0
1      2015-01-04 01:00:00                138   93.0     5.0
0      2015-01-04 00:00:00                182   93.0     6.0

[17414 rows x 4 columns]

In [34]:
df.sort_values('viento',ascending=False)

                     fecha  bicis-compartidas   hum  viento
7597   2015-11-17 21:00:00                644  59.0    56.5
9563   2016-02-08 15:00:00                556  71.0    56.0
10716  2016-03-28 08:00:00                 65  87.0    54.0
10714  2016-03-28 06:00:00                 47  73.5    52.0
9564   2016-02-08 16:00:00                964  66.0    51.0
...                    ...                ...   ...     ...
11602  2016-05-04 07:00:00               2536  62.0     0.0
9083   2016-01-19 08:00:00               3887  80.0     0.0
15735  2016-10-25 23:00:00                444  94.0     0.0
9085   2016-01-19 10:00:00                833  75.5     0.0
4338   2015-07-04 05:00:00                114  94.0     0.0

[17414 rows x 4 columns]

In [35]:
df.to_csv('nombre del archivo.csv')#,columns = ['nombre de columnas a almacenar'],index=False)

In [36]:
df['hum'][0] = 92.0
df

                     fecha  bicis-compartidas    hum  viento
0      2015-01-04 00:00:00                182   92.0     6.0
1      2015-01-04 01:00:00                138   93.0     5.0
2      2015-01-04 02:00:00                134   96.5     0.0
3      2015-01-04 03:00:00                 72  100.0     0.0
4      2015-01-04 04:00:00                 47   93.0     6.5
...                    ...                ...    ...     ...
17409  2017-01-03 19:00:00               1042   81.0    19.0
17410  2017-01-03 20:00:00                541   81.0    21.0
17411  2017-01-03 21:00:00                337   78.5    24.0
17412  2017-01-03 22:00:00                224   76.0    23.0
17413  2017-01-03 23:00:00                139   76.0    22.0

[17414 rows x 4 columns]

In [37]:
df.drop('viento',axis=1)

                     fecha  bicis-compartidas    hum
0      2015-01-04 00:00:00                182   92.0
1      2015-01-04 01:00:00                138   93.0
2      2015-01-04 02:00:00                134   96.5
3      2015-01-04 03:00:00                 72  100.0
4      2015-01-04 04:00:00                 47   93.0
...                    ...                ...    ...
17409  2017-01-03 19:00:00               1042   81.0
17410  2017-01-03 20:00:00                541   81.0
17411  2017-01-03 21:00:00                337   78.5
17412  2017-01-03 22:00:00                224   76.0
17413  2017-01-03 23:00:00                139   76.0

[17414 rows x 3 columns]

In [ ]:
#df.insert(1,'Viento',[100,200,300])

In [38]:
df.loc[df.viento > 20,['fecha','hum','viento']].sort_values('hum',ascending=False).head()  #loc se utiliza con etiquetas

                     fecha   hum  viento
16341  2016-11-20 07:00:00  97.0    22.5
7741   2015-11-24 05:00:00  94.0    23.0
16369  2016-11-21 11:00:00  94.0    21.0
3219   2015-05-18 11:00:00  94.0    31.0
6954   2015-10-22 01:00:00  94.0    21.5

In [39]:
a.head()

   nombre  edad   cm pais genero    Q1   Q2
0     ana    11  115   co      M   5.0  7.0
1  benito    10  110   mx      F  10.0  9.0
2  camilo    14  130   co      F   8.0  9.0
3  daniel    15  155   mx      M   NaN  8.0
4   erika    13  125   mx      M   7.0  8.0

In [40]:
a.loc[0:2,['nombre','edad']]

   nombre  edad
0     ana    11
1  benito    10
2  camilo    14

In [41]:
a.iloc[0:2,0:2]           #iloc se utilza con indices

   nombre  edad
0     ana    11
1  benito    10

In [42]:
a.loc[a['edad']>13]['nombre']     #consultas

2    camilo
3    daniel
Name: nombre, dtype: object

In [43]:
a.loc[(a.edad>10) & (a.Q1 > 4),'nombre']

0       ana
2    camilo
4     erika
5    fabian
Name: nombre, dtype: object

In [44]:
a.loc[a.nombre.str.endswith('o')]

   nombre  edad   cm pais genero    Q1   Q2
1  benito    10  110   mx      F  10.0  9.0
2  camilo    14  130   co      F   8.0  9.0

In [45]:
a.loc[~a.nombre.str.endswith('o')]         #Que no terminen con o

     nombre  edad   cm pais genero   Q1   Q2
0       ana    11  115   co      M  5.0  7.0
3    daniel    15  155   mx      M  NaN  8.0
4     erika    13  125   mx      M  7.0  8.0
5    fabian    12  120   ch      M  8.0  8.0
6  gabriela    13  125   ch      F  3.0  9.0

In [46]:
a.loc[a.nombre.isin(['Rodrigo','Aldo'])]

Empty DataFrame
Columns: [nombre, edad, cm, pais, genero, Q1, Q2]
Index: []

In [ ]:
#Agrupaciones   cuando hay elementos repetidos
#df.groupby('nombre columna').nombrecolumna.sum()
#df.groupby('nombre columna').nombrecolumna.sum().to_frame('nombre columna')
#df.groupby('nombre columna').filter(lambda fruta: fruta.cantidad.sum() > 10)

In [47]:
train_df = pd.read_csv('titanic-train.csv')
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [48]:
train_df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [49]:
train_df.Sex.value_counts()[0],train_df[(train_df.Survived == 1)].Sex.value_counts()[1]   
#Busqueda de dos Valores cuando hay dos columnas de por medio  Hombres totales y los hombres que sobrevivieron

(577, 109)

In [50]:
train_df.Survived.value_counts()#[1]   #Buscar valor en una sola columna  Total sobrevvieron Hom y Muj

0    549
1    342
Name: Survived, dtype: int64

In [51]:
train_df[(train_df.Survived == 1)].Sex.value_counts()#[0]     #Buscar Valor cuando hay dos columnas de pormedio

female    233
male      109
Name: Sex, dtype: int64

In [52]:
train_df.groupby('Sex').Survived.value_counts()

Sex     Survived
female  1           233
        0            81
male    0           468
        1           109
Name: Survived, dtype: int64

In [53]:
train_df['Pclass'].replace(1,'A')    #Reemplazar valores con pandas

0      3
1      A
2      3
3      A
4      3
      ..
886    2
887    A
888    3
889    A
890    3
Name: Pclass, Length: 891, dtype: object

In [54]:
a = train_df['Pclass'].replace({1:'A', 2: 'B',3:'C'})
train_df['PClass1'] = a
train_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,PClass1
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,C
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,A
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,A
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,C
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,B
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,A
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,C
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,A
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,C

In [55]:
Pclass2 = []
for i in train_df['Pclass']:    
    if i == 1:
        Pclass2.append('A')
    elif i ==2:
        Pclass2.append('B')
    else:
        Pclass2.append('C')
        
Pclass2
train_df['Pclass2'] = Pclass2    
train_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,PClass1,Pclass2
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,C,C
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,A,A
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,C,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,A,A
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,C,C
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,B,B
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,A,A
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,C,C
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,A,A
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,C,C

In [56]:
y = train_df.PClass1 == train_df.Pclass2
y.unique()

array([ True])

In [57]:
df = pd.read_csv('salarios.csv')
df.head(5)

   Aexperiencia  Salario
0          10.0    42500
1           8.0    36302
2           5.4    35000
3           2.5    18103
4           1.0    15000

In [58]:
paises = ['MX','US', 'BR','AR','CO', 'CA']
df['Paises'] = [paises[np.random.randint(0,len(paises))] for i in range(30)]   #Aleatorio de paises
df['idPaises'] = pd.factorize(df['Paises'])[0]  # Categoriza los paises aleatorios
df.head(10)

   Aexperiencia  Salario Paises  idPaises
0          10.0    42500     AR         0
1           8.0    36302     US         1
2           5.4    35000     AR         0
3           2.5    18103     US         1
4           1.0    15000     US         1
5           8.0    37000     CA         2
6           4.0    26300     CA         2
7           6.0    35201     CA         2
8           2.0    18302     US         1
9          10.0    42000     AR         0